Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS19">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS24">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS25">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS26">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS27">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS2__CSS48">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS2__CSS49">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS2__CSS50">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS2__CSS52">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS2__CSS53">
         <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="" value="0x1" />
         <value caption="Skip ANx for input scan" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY0">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY1">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY2">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY3">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY4">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY5">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY6">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY7">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT1__ARDY8">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
