Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC0" name="ADCDSTAT__RBF0">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC1" name="ADCDSTAT__RBF1">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC2" name="ADCDSTAT__RBF2">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC3" name="ADCDSTAT__RBF3">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC4" name="ADCDSTAT__RBF4">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Status bits for ADC5" name="ADCDSTAT__RBF5">
         <value caption="RAM DMA ping-pong Buffer B is full" name="" value="0x1" />
         <value caption="RAM DMA pin-pong Buffer B is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC0" name="ADCDSTAT__RBFIEN0">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC1" name="ADCDSTAT__RBFIEN1">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC2" name="ADCDSTAT__RBFIEN2">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC3" name="ADCDSTAT__RBFIEN3">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="RAM DMA Buffer B Full Interrupt Enable bits for ADC4" name="ADCDSTAT__RBFIEN4">
         <value caption="Enable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x1" />
         <value caption="Disable ping-pong DMA Buffer B interrupt requests for ADC5-ADC0" name="" value="0x0" />
      </value-group>
      <value-group caption="Global ADC DMA Enable bit" name="ADCDSTAT__DMAEN">
         <value caption="DMA interface is enabled" name="" value="0x1" />
         <value caption="DMA interface is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL0">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL1">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL2">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL3">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL4">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL5">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Level and Edge Sensitivity bits" name="ADCTRGSNS__LVL6">
         <value caption="Analog input is sensitive to the high level of its trigger (level sensitivity implies retriggering as long as the trigger signal remains high)" name="" value="0x1" />
         <value caption="Analog input is sensitive to the positive edge of its trigger (this is the value after a reset)" name="" value="0x0" />
      </value-group>
