Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
      <value-group caption="Operation Mode Status bits" name="C3CON__OPMOD">
         <value caption="Module is in Listen All Messages mode" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Module is in Configuration mode" name="" value="0x4" />
         <value caption="Module is in Listen Only mode" name="" value="0x3" />
         <value caption="Module is in Loopback mode" name="" value="0x2" />
         <value caption="Module is in Disable mode" name="" value="0x1" />
         <value caption="Module is in Normal Operation mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Request Operation Mode bits" name="C3CON__REQOP">
         <value caption="Set Listen All Messages mode" name="" value="0x7" />
         <value caption="Reserved - Do not use" name="" value="0x6" />
         <value caption="Reserved - Do not use" name="" value="0x5" />
         <value caption="Set Configuration mode" name="" value="0x4" />
         <value caption="Set Listen Only mode" name="" value="0x3" />
         <value caption="Set Loopback mode" name="" value="0x2" />
         <value caption="Set Disable mode" name="" value="0x1" />
         <value caption="Set Normal Operation mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Abort All Pending Transmissions bit" name="C3CON__ABAT">
         <value caption="Signal all transmit buffers to abort transmission" name="" value="0x1" />
         <value caption="Module will clear this bit when all transmissions aborted" name="" value="0x0" />
      </value-group>
      <value-group caption="Device Net Filter Bit Number bits" name="C4CON__DNCNT">
         <value caption="Invalid Selection (compare up to 18-bits of data with EID)" name="" value="10011-11111" />
         <value caption="Compare up to data byte 2 bit 6 with EID17 (CiRXFn)" name="" value="0x12" />
         <value caption="Compare up to data byte 0 bit 7 with EID0 (CiRXFn)" name="" value="0x1" />
         <value caption="Do not compare data bytes" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Module is Busy bit" name="C4CON__CANBUSY">
         <value caption="The CAN module is active" name="" value="0x1" />
         <value caption="The CAN module is completely disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN On bit" name="C4CON__ON">
         <value caption="CAN module is enabled" name="" value="0x1" />
         <value caption="CAN module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Message Receive Time Stamp Timer Capture Enable bit" name="C4CON__CANCAP">
         <value caption="CANTMR value is stored on valid message reception and is stored with the message" name="" value="0x10" />
         <value caption="Disable CAN message receive time stamp timer capture and stop CANTMR to conserve power" name="" value="0x0" />
      </value-group>
      <value-group caption="Operation Mode Status bits" name="C4CON__OPMOD">
         <value caption="Module is in Listen All Messages mode" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Module is in Configuration mode" name="" value="0x4" />
         <value caption="Module is in Listen Only mode" name="" value="0x3" />
         <value caption="Module is in Loopback mode" name="" value="0x2" />
         <value caption="Module is in Disable mode" name="" value="0x1" />
         <value caption="Module is in Normal Operation mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Request Operation Mode bits" name="C4CON__REQOP">
         <value caption="Set Listen All Messages mode" name="" value="0x7" />
         <value caption="Reserved - Do not use" name="" value="0x6" />
         <value caption="Reserved - Do not use" name="" value="0x5" />
         <value caption="Set Configuration mode" name="" value="0x4" />
         <value caption="Set Listen Only mode" name="" value="0x3" />
         <value caption="Set Loopback mode" name="" value="0x2" />
         <value caption="Set Disable mode" name="" value="0x1" />
         <value caption="Set Normal Operation mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Abort All Pending Transmissions bit" name="C4CON__ABAT">
         <value caption="Signal all transmit buffers to abort transmission" name="" value="0x1" />
         <value caption="Module will clear this bit when all transmissions aborted" name="" value="0x0" />
      </value-group>
      <value-group caption="Baud Rate Prescaler bits" name="C1CFG__BRP">
         <value caption="Tq = (2 x 64)/Tpbclk5" name="" value="0x3f" />
         <value caption="Tq = (2 x 63)/Tpbclk5" name="" value="0x3e" />
         <value caption="Tq = (2 x 2)/Tpbclk5" name="" value="0x1" />
         <value caption="Tq = (2 x 1)/Tpbclk5" name="" value="0x0" />
      </value-group>
      <value-group caption="Synchronization Jump Width bits" name="C1CFG__SJW">
         <value caption="Length is 4 x Tq" name="" value="0x3" />
         <value caption="Length is 3 x Tq" name="" value="0x2" />
         <value caption="Length is 2 x Tq" name="" value="0x1" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Propagation Time Segment bits" name="C1CFG__PRSEG">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Buffer Segment 1 bits" name="C1CFG__SEG1PH">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Sample of the CAN Bus Line bit" name="C1CFG__SAM">
         <value caption="Bus line is sampled three times at the sample point" name="" value="0x1" />
         <value caption="Bus line is sampled once at the sample point" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Segment 2 Time Select bit" name="C1CFG__SEG2PHTS">
         <value caption="Freely programmable" name="" value="0x1" />
         <value caption="Maximum of SEG1PH or Information Processing Time" name="" value="0x0" />
      </value-group>
      <value-group caption="Phase Buffer Segment 2 bits" name="C1CFG__SEG2PH">
         <value caption="Length is 8 x Tq" name="" value="0x7" />
         <value caption="Length is 1 x Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Bus Line Filter Enable bit" name="C1CFG__WAKFIL">
         <value caption="Use CAN bus line filter for wake-up" name="" value="0x1" />
         <value caption="CAN bus line filter is not used for wake-up" name="" value="0x0" />
      </value-group>
      <value-group caption="Baud Rate Prescaler bits" name="C2CFG__BRP">
         <value caption="Tq = (2 x 64)/Tpbclk5" name="" value="0x3f" />
         <value caption="Tq = (2 x 63)/Tpbclk5" name="" value="0x3e" />
         <value caption="Tq = (2 x 2)/Tpbclk5" name="" value="0x1" />
         <value caption="Tq = (2 x 1)/Tpbclk5" name="" value="0x0" />
      </value-group>
