Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
         <register caption="Comparator 'x' Mask Control Register ('x' = 1-5)" name="CM5MSKCON" offset="0xa0" rw="RW" size="4">
            <bitfield caption="AND Gate &quot;A&quot; Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM5MSKCON__AANEN" />
            <bitfield caption="AND Gate &quot;A&quot; Input Enable bit" mask="0x00000002" name="AAEN" values="CM5MSKCON__AAEN" />
            <bitfield caption="AND Gate &quot;B&quot; Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM5MSKCON__ABNEN" />
            <bitfield caption="AND Gate &quot;B&quot; Input Enable bit" mask="0x00000008" name="ABEN" values="CM5MSKCON__ABEN" />
            <bitfield caption="AND Gate &quot;C&quot; Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM5MSKCON__ACNEN" />
            <bitfield caption="AND Gate &quot;C&quot; Input Enable bit" mask="0x00000020" name="ACEN" values="CM5MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM5MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM5MSKCON__NAGS" />
            <bitfield caption="OR Gate &quot;A&quot; Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM5MSKCON__OANEN" />
            <bitfield caption="OR Gate &quot;A&quot; Input Enable bit" mask="0x00000200" name="OAEN" values="CM5MSKCON__OAEN" />
            <bitfield caption="OR Gate &quot;B&quot; Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM5MSKCON__OBNEN" />
            <bitfield caption="OR Gate &quot;B&quot; Input Enable bit" mask="0x00000800" name="OBEN" values="CM5MSKCON__OBEN" />
            <bitfield caption="OR Gate &quot;C&quot; Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM5MSKCON__OCNEN" />
            <bitfield caption="OR Gate &quot;C&quot; Input Enable bit" mask="0x00002000" name="OCEN" values="CM5MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM5MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM5MSKCON__SELSRCA" />
            <bitfield mask="0x00F00000" name="SELSRCB" />
            <bitfield mask="0x0F000000" name="SELSRCC" />
         </register>
      </register-group>
      <value-group caption="Op amp/Comparator 1 Output Status bit" name="CMSTAT__C1OUT">
         <value caption="(When CPOL is 0) Vin+ &gt; Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) VIN+  VTH+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 2 Output Status bit" name="CMSTAT__C2OUT">
         <value caption="(When CPOL is 0) Vin+ &gt; Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) VIN+  VTH+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 3 Output Status bit" name="CMSTAT__C3OUT">
         <value caption="(When CPOL is 0) Vin+ &gt; Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) VIN+  VTH+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 4 Output Status bit" name="CMSTAT__C4OUT">
         <value caption="(When CPOL is 0) Vin+ &gt; Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) VIN+  VTH+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 5 Output Status bit" name="CMSTAT__C5OUT">
         <value caption="(When CPOL is 0) Vin+ &gt; Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) VIN+  VTH+" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="CMSTAT__SIDL">
         <value caption="Discontinue operation of all Op amp/Comparators when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Channel Select bits" name="CM1CON__CCH">
         <value caption="CxIN4-" name="" value="0x3" />
         <value caption="CxIN3-" name="" value="0x2" />
         <value caption="CxIN2-" name="" value="0x1" />
         <value caption="CxIN1-" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator Reference Select bit" name="CM1CON__CREF">
         <value caption="VIN+ input connects to internal CDAC3 output voltage" name="" value="0x1" />
         <value caption="VIN+ input connects to CxIN1+ pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger/Event Polarity Select bits" name="CM1CON__EVPOL">
         <value caption="Trigger/Event generated on any change of the comparator output" name="" value="0x3" />
         <value caption="(If CPOL is 0) High-to-low transition of the comparator output / (If CPOL is 1) Low-to-high transition of the comparator output" name="" value="0x2" />
         <value caption="(If CPOL is 0) Low-to-high transition of the comparator output / (If CPOL is 1) High-to-low transition of the comparator output" name="" value="0x1" />
         <value caption="Trigger/Event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM1CON__COUT">
         <value caption="(When CPOL is 0)VIN+ &gt; VTH+ / (When CPOL is 1) VIN+  VTH+ / (When CPOL is 1) VIN+ &lt; VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0)VIN+  VTH+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp Mode Enable bit" name="CM1CON__AMPMOD">
         <value caption="Amplifier/Comparator operating in Dual mode (both Op amps and Comparators are enabled)" name="" value="0x1" />
         <value caption="Amplifier/Comparator operating in Comparator-only mode" name="" value="0x0" />
      </value-group>
