Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
         <register caption="Change Notice control for PORTx Register" name="CNCONF" offset="0x570" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONF__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONF__ON" />
         </register>
         <register caption="Change Notice control for PORTx Register" name="CNCONG" offset="0x670" rw="RW" size="4">
            <bitfield caption="Change Notification Style bit" mask="0x00000800" name="EDGEDETECT" values="CNCONG__EDGEDETECT" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="Change Notice Control ON bit" mask="0x00008000" name="ON" values="CNCONG__ON" />
         </register>
         <register caption="" name="CNENA" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEA0" />
            <bitfield mask="0x00000002" name="CNIEA1" />
            <bitfield mask="0x00000010" name="CNIEA4" />
            <bitfield mask="0x00000080" name="CNIEA7" />
            <bitfield mask="0x00000100" name="CNIEA8" />
            <bitfield mask="0x00000400" name="CNIEA10" />
            <bitfield mask="0x00000800" name="CNIEA11" />
            <bitfield mask="0x00001000" name="CNIEA12" />
         </register>
         <register caption="" name="CNENB" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEB0" />
            <bitfield mask="0x00000002" name="CNIEB1" />
            <bitfield mask="0x00000004" name="CNIEB2" />
            <bitfield mask="0x00000008" name="CNIEB3" />
            <bitfield mask="0x00000010" name="CNIEB4" />
            <bitfield mask="0x00000020" name="CNIEB5" />
            <bitfield mask="0x00000040" name="CNIEB6" />
            <bitfield mask="0x00000080" name="CNIEB7" />
            <bitfield mask="0x00000100" name="CNIEB8" />
            <bitfield mask="0x00000200" name="CNIEB9" />
            <bitfield mask="0x00000400" name="CNIEB10" />
            <bitfield mask="0x00000800" name="CNIEB11" />
            <bitfield mask="0x00001000" name="CNIEB12" />
            <bitfield mask="0x00002000" name="CNIEB13" />
            <bitfield mask="0x00004000" name="CNIEB14" />
            <bitfield mask="0x00008000" name="CNIEB15" />
         </register>
         <register caption="" name="CNENC" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEC0" />
            <bitfield mask="0x00000002" name="CNIEC1" />
            <bitfield mask="0x00000004" name="CNIEC2" />
            <bitfield mask="0x00000040" name="CNIEC6" />
            <bitfield mask="0x00000080" name="CNIEC7" />
            <bitfield mask="0x00000100" name="CNIEC8" />
            <bitfield mask="0x00000200" name="CNIEC9" />
            <bitfield mask="0x00000400" name="CNIEC10" />
            <bitfield mask="0x00000800" name="CNIEC11" />
            <bitfield mask="0x00001000" name="CNIEC12" />
            <bitfield mask="0x00002000" name="CNIEC13" />
            <bitfield mask="0x00004000" name="CNIEC14" />
            <bitfield mask="0x00008000" name="CNIEC15" />
         </register>
         <register caption="" name="CNEND" offset="0x380" rw="RW" size="4">
            <bitfield mask="0x00000020" name="CNIED5" />
            <bitfield mask="0x00000040" name="CNIED6" />
            <bitfield mask="0x00000100" name="CNIED8" />
         </register>
         <register caption="" name="CNENE" offset="0x480" rw="RW" size="4">
            <bitfield mask="0x00001000" name="CNIEE12" />
            <bitfield mask="0x00002000" name="CNIEE13" />
            <bitfield mask="0x00004000" name="CNIEE14" />
            <bitfield mask="0x00008000" name="CNIEE15" />
         </register>
         <register caption="" name="CNENF" offset="0x580" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNIEF0" />
            <bitfield mask="0x00000002" name="CNIEF1" />
         </register>
         <register caption="" name="CNENG" offset="0x680" rw="RW" size="4">
            <bitfield mask="0x00000040" name="CNIEG6" />
            <bitfield mask="0x00000080" name="CNIEG7" />
            <bitfield mask="0x00000100" name="CNIEG8" />
            <bitfield mask="0x00000200" name="CNIEG9" />
         </register>
         <register caption="" name="CNSTATA" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATA0" />
            <bitfield mask="0x00000002" name="CNSTATA1" />
            <bitfield mask="0x00000010" name="CNSTATA4" />
            <bitfield mask="0x00000080" name="CNSTATA7" />
            <bitfield mask="0x00000100" name="CNSTATA8" />
            <bitfield mask="0x00000400" name="CNSTATA10" />
            <bitfield mask="0x00000800" name="CNSTATA11" />
            <bitfield mask="0x00001000" name="CNSTATA12" />
         </register>
         <register caption="" name="CNSTATB" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATB0" />
            <bitfield mask="0x00000002" name="CNSTATB1" />
            <bitfield mask="0x00000004" name="CNSTATB2" />
            <bitfield mask="0x00000008" name="CNSTATB3" />
            <bitfield mask="0x00000010" name="CNSTATB4" />
            <bitfield mask="0x00000020" name="CNSTATB5" />
            <bitfield mask="0x00000040" name="CNSTATB6" />
            <bitfield mask="0x00000080" name="CNSTATB7" />
            <bitfield mask="0x00000100" name="CNSTATB8" />
            <bitfield mask="0x00000200" name="CNSTATB9" />
            <bitfield mask="0x00000400" name="CNSTATB10" />
            <bitfield mask="0x00000800" name="CNSTATB11" />
            <bitfield mask="0x00001000" name="CNSTATB12" />
            <bitfield mask="0x00002000" name="CNSTATB13" />
            <bitfield mask="0x00004000" name="CNSTATB14" />
            <bitfield mask="0x00008000" name="CNSTATB15" />
         </register>
         <register caption="" name="CNSTATC" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATC0" />
            <bitfield mask="0x00000002" name="CNSTATC1" />
            <bitfield mask="0x00000004" name="CNSTATC2" />
            <bitfield mask="0x00000040" name="CNSTATC6" />
            <bitfield mask="0x00000080" name="CNSTATC7" />
            <bitfield mask="0x00000100" name="CNSTATC8" />
            <bitfield mask="0x00000200" name="CNSTATC9" />
            <bitfield mask="0x00000400" name="CNSTATC10" />
            <bitfield mask="0x00000800" name="CNSTATC11" />
            <bitfield mask="0x00001000" name="CNSTATC12" />
            <bitfield mask="0x00002000" name="CNSTATC13" />
            <bitfield mask="0x00004000" name="CNSTATC14" />
            <bitfield mask="0x00008000" name="CNSTATC15" />
         </register>
         <register caption="" name="CNSTATD" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000020" name="CNSTATD5" />
            <bitfield mask="0x00000040" name="CNSTATD6" />
            <bitfield mask="0x00000100" name="CNSTATD8" />
         </register>
         <register caption="" name="CNSTATE" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00001000" name="CNSTATE12" />
            <bitfield mask="0x00002000" name="CNSTATE13" />
            <bitfield mask="0x00004000" name="CNSTATE14" />
            <bitfield mask="0x00008000" name="CNSTATE15" />
         </register>
