Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
         <register caption="Interrupt Flag Status Register " name="IFS7" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SPI5EIF" />
            <bitfield mask="0x00000002" name="SPI5RXIF" />
            <bitfield mask="0x00000004" name="SPI5TXIF" />
            <bitfield mask="0x00000008" name="SPI6EIF" />
            <bitfield mask="0x00000010" name="SPI6RXIF" />
            <bitfield mask="0x00000020" name="SPI6TXIF" />
            <bitfield mask="0x00000040" name="SBIF" />
            <bitfield mask="0x00000080" name="PTGSTEPIF" />
            <bitfield mask="0x00000100" name="PTGWDTIF" />
            <bitfield mask="0x00000200" name="PTG0TR0" />
            <bitfield mask="0x00000400" name="PTG0TR1" />
            <bitfield mask="0x00000800" name="PTG0TR2" />
            <bitfield mask="0x00001000" name="PTG0TR3" />
            <bitfield mask="0x00004000" name="PWM7IF" />
            <bitfield mask="0x00008000" name="PWM8IF" />
            <bitfield mask="0x00010000" name="PWM9IF" />
            <bitfield mask="0x00020000" name="PWM10IF" />
            <bitfield mask="0x00040000" name="PWM11IF" />
            <bitfield mask="0x00080000" name="PWM12IF" />
            <bitfield mask="0x00100000" name="USB2IF" />
            <bitfield mask="0x00200000" name="AD1DC3IF" />
            <bitfield mask="0x00400000" name="AD1DC4IF" />
            <bitfield mask="0x40000000" name="CPCIF" />
            <bitfield mask="0x80000000" name="CFDCIF" />
         </register>
         <register caption="Interrupt Enable Control Register " name="IEC0" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIE" />
            <bitfield mask="0x00000002" name="CS0IE" />
            <bitfield mask="0x00000004" name="CS1IE" />
            <bitfield mask="0x00000008" name="INT0IE" />
            <bitfield mask="0x00000010" name="T1IE" />
            <bitfield mask="0x00000020" name="IC1EIE" />
            <bitfield mask="0x00000040" name="IC1IE" />
            <bitfield mask="0x00000080" name="OC1IE" />
            <bitfield mask="0x00000100" name="INT1IE" />
            <bitfield mask="0x00000200" name="T2IE" />
            <bitfield mask="0x00000400" name="IC2EIE" />
            <bitfield mask="0x00000800" name="IC2IE" />
            <bitfield mask="0x00001000" name="OC2IE" />
            <bitfield mask="0x00002000" name="INT2IE" />
            <bitfield mask="0x00004000" name="T3IE" />
            <bitfield mask="0x00008000" name="IC3EIE" />
            <bitfield mask="0x00010000" name="IC3IE" />
            <bitfield mask="0x00020000" name="OC3IE" />
            <bitfield mask="0x00040000" name="INT3IE" />
            <bitfield mask="0x00080000" name="T4IE" />
            <bitfield mask="0x00100000" name="IC4EIE" />
            <bitfield mask="0x00200000" name="IC4IE" />
            <bitfield mask="0x00400000" name="OC4IE" />
            <bitfield mask="0x00800000" name="INT4IE" />
            <bitfield mask="0x01000000" name="T5IE" />
            <bitfield mask="0x02000000" name="IC5EIE" />
            <bitfield mask="0x04000000" name="IC5IE" />
            <bitfield mask="0x08000000" name="OC5IE" />
            <bitfield mask="0x40000000" name="RTCCIE" />
            <bitfield mask="0x80000000" name="FCEIE" />
         </register>
         <register caption="Interrupt Enable Control Register " name="IEC1" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1IE" />
            <bitfield mask="0x00000002" name="CMP2IE" />
            <bitfield mask="0x00000004" name="USB1IE" />
            <bitfield mask="0x00000008" name="SPI1EIE" />
            <bitfield mask="0x00000010" name="SPI1RXIE" />
            <bitfield mask="0x00000020" name="SPI1TXIE" />
            <bitfield mask="0x00000040" name="U1EIE" />
            <bitfield mask="0x00000080" name="U1RXIE" />
            <bitfield mask="0x00000100" name="U1TXIE" />
            <bitfield mask="0x00000200" name="I2C1BIE" />
            <bitfield mask="0x00000400" name="I2C1SIE" />
            <bitfield mask="0x00000800" name="I2C1MIE" />
            <bitfield mask="0x00001000" name="CNAIE" />
            <bitfield mask="0x00002000" name="CNBIE" />
            <bitfield mask="0x00004000" name="CNCIE" />
            <bitfield mask="0x00008000" name="CNDIE" />
            <bitfield mask="0x00010000" name="CNEIE" />
            <bitfield mask="0x00020000" name="CNFIE" />
            <bitfield mask="0x00040000" name="CNGIE" />
            <bitfield mask="0x00080000" name="PMPIE" />
            <bitfield mask="0x00100000" name="PMPEIE" />
            <bitfield mask="0x00200000" name="SPI2EIE" />
            <bitfield mask="0x00400000" name="SPI2RXIE" />
            <bitfield mask="0x00800000" name="SPI2TXIE" />
            <bitfield mask="0x01000000" name="U2EIE" />
            <bitfield mask="0x02000000" name="U2RXIE" />
            <bitfield mask="0x04000000" name="U2TXIE" />
            <bitfield mask="0x08000000" name="I2C2BIE" />
            <bitfield mask="0x10000000" name="I2C2SIE" />
            <bitfield mask="0x20000000" name="I2C2MIE" />
            <bitfield mask="0x40000000" name="U3EIE" />
            <bitfield mask="0x80000000" name="U3RXIE" />
         </register>
         <register caption="Interrupt Enable Control Register " name="IEC2" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U3TXIE" />
            <bitfield mask="0x00000002" name="U4EIE" />
            <bitfield mask="0x00000004" name="U4RXIE" />
            <bitfield mask="0x00000008" name="U4TXIE" />
            <bitfield mask="0x00000010" name="U5EIE" />
            <bitfield mask="0x00000020" name="U5RXIE" />
            <bitfield mask="0x00000040" name="U5TXIE" />
            <bitfield mask="0x00000080" name="CTMUIE" />
            <bitfield mask="0x00000100" name="DMA0IE" />
            <bitfield mask="0x00000200" name="DMA1IE" />
            <bitfield mask="0x00000400" name="DMA2IE" />
            <bitfield mask="0x00000800" name="DMA3IE" />
            <bitfield mask="0x00001000" name="T6IE" />
            <bitfield mask="0x00002000" name="IC6EIE" />
            <bitfield mask="0x00004000" name="IC6IE" />
            <bitfield mask="0x00008000" name="OC6IE" />
            <bitfield mask="0x00010000" name="T7IE" />
            <bitfield mask="0x00020000" name="IC7EIE" />
            <bitfield mask="0x00040000" name="IC7IE" />
            <bitfield mask="0x00080000" name="OC7IE" />
            <bitfield mask="0x00100000" name="T8IE" />
            <bitfield mask="0x00200000" name="IC8EIE" />
            <bitfield mask="0x00400000" name="IC8IE" />
            <bitfield mask="0x00800000" name="OC8IE" />
            <bitfield mask="0x01000000" name="T9IE" />
            <bitfield mask="0x02000000" name="IC9EIE" />
            <bitfield mask="0x04000000" name="IC9IE" />
            <bitfield mask="0x08000000" name="OC9IE" />
            <bitfield mask="0x10000000" name="AD1IE" />
            <bitfield mask="0x40000000" name="AD1DC1IE" />
            <bitfield mask="0x80000000" name="AD1DC2IE" />
         </register>
         <register caption="Interrupt Enable Control Register " name="IEC3" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AD1DF1IE" />
            <bitfield mask="0x00000002" name="AD1DF2IE" />
            <bitfield mask="0x00000004" name="AD1DF3IE" />
            <bitfield mask="0x00000008" name="AD1DF4IE" />
            <bitfield mask="0x00000010" name="AD1FIIE" />
            <bitfield mask="0x00000020" name="AD1EOSIE" />
            <bitfield mask="0x00000040" name="AD1ARIE" />
            <bitfield mask="0x00000080" name="AD1RSIE" />
            <bitfield mask="0x00000100" name="AD1FCBTIE" />
            <bitfield mask="0x00000200" name="AD1GIE" />
            <bitfield mask="0x00000400" name="AD1D0IE" />
            <bitfield mask="0x00000800" name="AD1D1IE" />
            <bitfield mask="0x00001000" name="AD1D2IE" />
            <bitfield mask="0x00002000" name="AD1D3IE" />
            <bitfield mask="0x00004000" name="AD1D4IE" />
            <bitfield mask="0x00008000" name="AD1D5IE" />
            <bitfield mask="0x00010000" name="AD1D6IE" />
            <bitfield mask="0x00020000" name="AD1D7IE" />
            <bitfield mask="0x00040000" name="AD1D8IE" />
            <bitfield mask="0x00080000" name="AD1D9IE" />
            <bitfield mask="0x00100000" name="AD1D10IE" />
            <bitfield mask="0x00200000" name="AD1D11IE" />
            <bitfield mask="0x00400000" name="AD1D12IE" />
            <bitfield mask="0x00800000" name="AD1D13IE" />
            <bitfield mask="0x01000000" name="AD1D14IE" />
            <bitfield mask="0x02000000" name="AD1D15IE" />
            <bitfield mask="0x04000000" name="AD1D16IE" />
            <bitfield mask="0x08000000" name="AD1D17IE" />
            <bitfield mask="0x10000000" name="AD1D18IE" />
            <bitfield mask="0x20000000" name="AD1D19IE" />
            <bitfield mask="0x40000000" name="AD1D20IE" />
            <bitfield mask="0x80000000" name="AD1D21IE" />
         </register>
