Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
         <register caption="Interrupt Vector Address Offset Register" name="OFF147" offset="0x78c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF151" offset="0x79c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF152" offset="0x7a0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF153" offset="0x7a4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF154" offset="0x7a8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF155" offset="0x7ac" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF156" offset="0x7b0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF157" offset="0x7b4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF158" offset="0x7b8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF159" offset="0x7bc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF160" offset="0x7c0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF161" offset="0x7c4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF162" offset="0x7c8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF164" offset="0x7d0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF165" offset="0x7d4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF166" offset="0x7d8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF167" offset="0x7dc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF168" offset="0x7e0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF169" offset="0x7e4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF170" offset="0x7e8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF171" offset="0x7ec" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF172" offset="0x7f0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF173" offset="0x7f4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF174" offset="0x7f8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF175" offset="0x7fc" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF176" offset="0x800" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF177" offset="0x804" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF178" offset="0x808" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF179" offset="0x80c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF180" offset="0x810" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF181" offset="0x814" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF182" offset="0x818" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF183" offset="0x81c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF184" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF185" offset="0x824" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF186" offset="0x828" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF187" offset="0x82c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF188" offset="0x830" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF189" offset="0x834" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="Interrupt Vector Address Offset Register" name="OFF190" offset="0x838" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF191" offset="0x83c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF192" offset="0x840" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF194" offset="0x848" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
