Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON8" offset="0x7c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON8__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON8__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON8__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON8__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON8__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON8__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON8__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON8__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON8__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON8__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON8__PWMLIEN" />
            <bitfield mask="0x00200000" name="TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON8__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON8__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON8__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON8__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON8__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON8__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON8__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON9" offset="0x8c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON9__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON9__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON9__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON9__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON9__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON9__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON9__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON9__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON9__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON9__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON9__PWMLIEN" />
            <bitfield mask="0x00200000" name="TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON9__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON9__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON9__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON9__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON9__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON9__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON9__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON10" offset="0x9c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON10__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON10__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON10__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON10__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON10__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON10__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON10__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON10__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON10__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON10__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON10__PWMLIEN" />
            <bitfield mask="0x00200000" name="TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON10__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON10__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON10__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON10__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON10__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON10__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON10__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON11" offset="0xac0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON11__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON11__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON11__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON11__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON11__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON11__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON11__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON11__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON11__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON11__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON11__PWMLIEN" />
            <bitfield mask="0x00200000" name="TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON11__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON11__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON11__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON11__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON11__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON11__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON11__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON12" offset="0xbc0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON12__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON12__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON12__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON12__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON12__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON12__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON12__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON12__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON12__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON12__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON12__PWMLIEN" />
            <bitfield mask="0x00200000" name="TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON12__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON12__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON12__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON12__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON12__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON12__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON12__FLTIF" />
         </register>
