Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON10" offset="0x9d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON10__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON10__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON10__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON10__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON10__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON10__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON10__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON10__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON10__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON10__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON10__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON10__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON10__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON10__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON10__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON10__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON11" offset="0xad0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON11__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON11__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON11__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON11__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON11__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON11__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON11__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON11__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON11__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON11__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON11__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON11__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON11__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON11__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON11__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON11__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON12" offset="0xbd0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON12__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON12__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield caption="State for PWMxH" mask="0x000000C0" name="OVRDAT" values="IOCON12__OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON12__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON12__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON12__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON12__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON12__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON12__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON12__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON12__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON12__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON12__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON12__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON12__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON12__CLSRC" />
         </register>
