Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
         <register caption="QEIx I/O Control Register" name="QEI1IOC" offset="0x10" rw="RW" size="4">
            <bitfield caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000001" name="QEA" values="QEI1IOC__QEA" />
            <bitfield caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000002" name="QEB" values="QEI1IOC__QEB" />
            <bitfield caption="Status of INDXx Input Pin after Polarity Control bit" mask="0x00000004" name="INDEX" values="QEI1IOC__INDEX" />
            <bitfield caption="Status of HOMEx Input Pin after Polarity Control bit" mask="0x00000008" name="HOME" values="QEI1IOC__HOME" />
            <bitfield caption="QEAx Input Polarity Select bit" mask="0x00000010" name="QEAPOL" values="QEI1IOC__QEAPOL" />
            <bitfield caption="QEBx Input Polarity Select bit" mask="0x00000020" name="QEBPOL" values="QEI1IOC__QEBPOL" />
            <bitfield caption="INDXx Input Polarity Select bit" mask="0x00000040" name="IDXPOL" values="QEI1IOC__IDXPOL" />
            <bitfield caption="HOMEx Input Polarity Select bit" mask="0x00000080" name="HOMPOL" values="QEI1IOC__HOMPOL" />
            <bitfield caption="Swap QEA and QEB Inputs bit" mask="0x00000100" name="SWPAB" values="QEI1IOC__SWPAB" />
            <bitfield caption="QEI Module Output Function Mode Select bits" mask="0x00000600" name="OUTFNC" values="QEI1IOC__OUTFNC" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" mask="0x00003800" name="QFDIV" values="QEI1IOC__QFDIV" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" mask="0x00004000" name="FLTREN" values="QEI1IOC__FLTREN" />
            <bitfield caption="Position Counter Input Capture Enable bit" mask="0x00008000" name="QCAPEN" values="QEI1IOC__QCAPEN" />
            <bitfield caption="Position Counter Input Capture by Home Event Enable bit" mask="0x00010000" name="HCAPEN" values="QEI1IOC__HCAPEN" />
         </register>
         <register caption="QEIx I/O Control Register" name="QEI2IOC" offset="0x210" rw="RW" size="4">
            <bitfield caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000001" name="QEA" values="QEI2IOC__QEA" />
            <bitfield caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000002" name="QEB" values="QEI2IOC__QEB" />
            <bitfield caption="Status of INDXx Input Pin after Polarity Control bit" mask="0x00000004" name="INDEX" values="QEI2IOC__INDEX" />
            <bitfield caption="Status of HOMEx Input Pin after Polarity Control bit" mask="0x00000008" name="HOME" values="QEI2IOC__HOME" />
            <bitfield caption="QEAx Input Polarity Select bit" mask="0x00000010" name="QEAPOL" values="QEI2IOC__QEAPOL" />
            <bitfield caption="QEBx Input Polarity Select bit" mask="0x00000020" name="QEBPOL" values="QEI2IOC__QEBPOL" />
            <bitfield caption="INDXx Input Polarity Select bit" mask="0x00000040" name="IDXPOL" values="QEI2IOC__IDXPOL" />
            <bitfield caption="HOMEx Input Polarity Select bit" mask="0x00000080" name="HOMPOL" values="QEI2IOC__HOMPOL" />
            <bitfield caption="Swap QEA and QEB Inputs bit" mask="0x00000100" name="SWPAB" values="QEI2IOC__SWPAB" />
            <bitfield caption="QEI Module Output Function Mode Select bits" mask="0x00000600" name="OUTFNC" values="QEI2IOC__OUTFNC" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" mask="0x00003800" name="QFDIV" values="QEI2IOC__QFDIV" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" mask="0x00004000" name="FLTREN" values="QEI2IOC__FLTREN" />
            <bitfield caption="Position Counter Input Capture Enable bit" mask="0x00008000" name="QCAPEN" values="QEI2IOC__QCAPEN" />
            <bitfield caption="Position Counter Input Capture by Home Event Enable bit" mask="0x00010000" name="HCAPEN" values="QEI2IOC__HCAPEN" />
         </register>
         <register caption="QEIx I/O Control Register" name="QEI3IOC" offset="0x410" rw="RW" size="4">
            <bitfield caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000001" name="QEA" values="QEI3IOC__QEA" />
            <bitfield caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000002" name="QEB" values="QEI3IOC__QEB" />
            <bitfield caption="Status of INDXx Input Pin after Polarity Control bit" mask="0x00000004" name="INDEX" values="QEI3IOC__INDEX" />
            <bitfield caption="Status of HOMEx Input Pin after Polarity Control bit" mask="0x00000008" name="HOME" values="QEI3IOC__HOME" />
            <bitfield caption="QEAx Input Polarity Select bit" mask="0x00000010" name="QEAPOL" values="QEI3IOC__QEAPOL" />
            <bitfield caption="QEBx Input Polarity Select bit" mask="0x00000020" name="QEBPOL" values="QEI3IOC__QEBPOL" />
            <bitfield caption="INDXx Input Polarity Select bit" mask="0x00000040" name="IDXPOL" values="QEI3IOC__IDXPOL" />
            <bitfield caption="HOMEx Input Polarity Select bit" mask="0x00000080" name="HOMPOL" values="QEI3IOC__HOMPOL" />
            <bitfield caption="Swap QEA and QEB Inputs bit" mask="0x00000100" name="SWPAB" values="QEI3IOC__SWPAB" />
            <bitfield caption="QEI Module Output Function Mode Select bits" mask="0x00000600" name="OUTFNC" values="QEI3IOC__OUTFNC" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" mask="0x00003800" name="QFDIV" values="QEI3IOC__QFDIV" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" mask="0x00004000" name="FLTREN" values="QEI3IOC__FLTREN" />
            <bitfield caption="Position Counter Input Capture Enable bit" mask="0x00008000" name="QCAPEN" values="QEI3IOC__QCAPEN" />
            <bitfield caption="Position Counter Input Capture by Home Event Enable bit" mask="0x00010000" name="HCAPEN" values="QEI3IOC__HCAPEN" />
         </register>
         <register caption="QEIx I/O Control Register" name="QEI4IOC" offset="0x610" rw="RW" size="4">
            <bitfield caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000001" name="QEA" values="QEI4IOC__QEA" />
            <bitfield caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" mask="0x00000002" name="QEB" values="QEI4IOC__QEB" />
            <bitfield caption="Status of INDXx Input Pin after Polarity Control bit" mask="0x00000004" name="INDEX" values="QEI4IOC__INDEX" />
            <bitfield caption="Status of HOMEx Input Pin after Polarity Control bit" mask="0x00000008" name="HOME" values="QEI4IOC__HOME" />
            <bitfield caption="QEAx Input Polarity Select bit" mask="0x00000010" name="QEAPOL" values="QEI4IOC__QEAPOL" />
            <bitfield caption="QEBx Input Polarity Select bit" mask="0x00000020" name="QEBPOL" values="QEI4IOC__QEBPOL" />
            <bitfield caption="INDXx Input Polarity Select bit" mask="0x00000040" name="IDXPOL" values="QEI4IOC__IDXPOL" />
            <bitfield caption="HOMEx Input Polarity Select bit" mask="0x00000080" name="HOMPOL" values="QEI4IOC__HOMPOL" />
            <bitfield caption="Swap QEA and QEB Inputs bit" mask="0x00000100" name="SWPAB" values="QEI4IOC__SWPAB" />
            <bitfield caption="QEI Module Output Function Mode Select bits" mask="0x00000600" name="OUTFNC" values="QEI4IOC__OUTFNC" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" mask="0x00003800" name="QFDIV" values="QEI4IOC__QFDIV" />
            <bitfield caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" mask="0x00004000" name="FLTREN" values="QEI4IOC__FLTREN" />
            <bitfield caption="Position Counter Input Capture Enable bit" mask="0x00008000" name="QCAPEN" values="QEI4IOC__QCAPEN" />
            <bitfield caption="Position Counter Input Capture by Home Event Enable bit" mask="0x00010000" name="HCAPEN" values="QEI4IOC__HCAPEN" />
         </register>
