Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
      <value-group caption="QEAx Input Polarity Select bit" name="QEI5IOC__QEAPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="QEBx Input Polarity Select bit" name="QEI5IOC__QEBPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="INDXx Input Polarity Select bit" name="QEI5IOC__IDXPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="HOMEx Input Polarity Select bit" name="QEI5IOC__HOMPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Swap QEA and QEB Inputs bit" name="QEI5IOC__SWPAB">
         <value caption="QEAx and QEBx are swapped prior to quadrature decoder logic" name="" value="0x1" />
         <value caption="QEAx and QEBx are not swapped" name="" value="0x0" />
      </value-group>
      <value-group caption="QEI Module Output Function Mode Select bits" name="QEI5IOC__OUTFNC">
         <value caption="The CNTCMPx pin goes high when POSxCNT QEIxCMPL or POSxCNT  QEIxICCH" name="" value="0x3" />
         <value caption="The CNTCMPx pin goes high when POSxCNT  QEIxCMPL" name="" value="0x2" />
         <value caption="The CNTCMPx pin goes high when POSxCNT QEIxICCH" name="" value="0x1" />
         <value caption="Output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits" name="QEI5IOC__QFDIV">
         <value caption="1:128 clock divide" name="" value="0x7" />
         <value caption="1:64 clock divide" name="" value="0x6" />
         <value caption="1:32 clock divide" name="" value="0x5" />
         <value caption="1:16 clock divide" name="" value="0x4" />
         <value caption="1:8 clock divide" name="" value="0x3" />
         <value caption="1:4 clock divide" name="" value="0x2" />
         <value caption="1:2 clock divide" name="" value="0x1" />
      </value-group>
      <value-group caption="QEA/QEB/INDX/HOMEx Digital Filter Enable bit" name="QEI5IOC__FLTREN">
         <value caption="Input Pin Digital filter is enabled" name="" value="0x1" />
         <value caption="Input Pin Digital filter is disabled (bypassed)" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Input Capture Enable bit" name="QEI5IOC__QCAPEN">
         <value caption="Positive edge detect of Home input triggers position capture function" name="" value="0x1" />
         <value caption="Home input event (positive edge) does not trigger a capture even" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Input Capture by Home Event Enable bit" name="QEI5IOC__HCAPEN">
         <value caption="HOMEx input event (positive edge) triggers a position capture event" name="" value="0x1" />
         <value caption="HOMEx input event (positive edge) does not trigger a position capture event" name="" value="0x0" />
      </value-group>
      <value-group caption="Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit" name="QEI6IOC__QEA">
         <value caption="see datasheet" name="" value="0x1" />
         <value caption="see datasheet" name="" value="0x0" />
      </value-group>
      <value-group caption="Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit" name="QEI6IOC__QEB">
         <value caption="see datasheet" name="" value="0x1" />
         <value caption="see datasheet" name="" value="0x0" />
      </value-group>
      <value-group caption="Status of INDXx Input Pin after Polarity Control bit" name="QEI6IOC__INDEX">
         <value caption="(if IDXPOL bit is set to 0) Pin is at logic 1 / (if IDXPOL bit is set to 1) Pin is at logic 0" name="" value="0x1" />
         <value caption="(if IDXPOL bit is set to 0) Pin is at logic 0 / (if IDXPOL bit is set to 1) Pin is at logic 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Status of HOMEx Input Pin after Polarity Control bit" name="QEI6IOC__HOME">
         <value caption="(if HOMPOL bit is set to 0) Pin is at logic 1 / (if HOMPOL bit is set to 1) Pin is at logic 0" name="" value="0x1" />
         <value caption="(if HOMPOL bit is set to 0) Pin is at logic 0 / (if HOMPOL bit is set to 1) Pin is at logic 1" name="" value="0x0" />
      </value-group>
      <value-group caption="QEAx Input Polarity Select bit" name="QEI6IOC__QEAPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="QEBx Input Polarity Select bit" name="QEI6IOC__QEBPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="INDXx Input Polarity Select bit" name="QEI6IOC__IDXPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="HOMEx Input Polarity Select bit" name="QEI6IOC__HOMPOL">
         <value caption="Input is inverted" name="" value="0x1" />
         <value caption="Input is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Swap QEA and QEB Inputs bit" name="QEI6IOC__SWPAB">
         <value caption="QEAx and QEBx are swapped prior to quadrature decoder logic" name="" value="0x1" />
         <value caption="QEAx and QEBx are not swapped" name="" value="0x0" />
      </value-group>
