Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
      <value-group caption="Synchronized Timer Start/Stop Enable bit" name="T6CON__SYNC">
         <value caption="Synchronized timer Start/Stop is enabled" name="ENABLED" value="0x1" />
         <value caption="Synchronized timer Start/Stop is disabled" name="DISABLED" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T6CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="STOP" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="CONTINUE" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T6CON__ON">
         <value caption="Module is enabled" name="ON" value="0x1" />
         <value caption="Module is disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Timer Clock Source Select bit" name="T7CON__TCS">
         <value caption="External clock from TxCK pin" name="EXT_CLK" value="0x1" />
         <value caption="Internal peripheral clock" name="INT_CLK" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T7CON__T32">
         <value caption="32-bit Timer mode" name="32_BIT" value="0x1" />
         <value caption="16-bit Timer mode" name="16_BIT" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T7CON__TCKPS">
         <value caption="1:256 prescale value" name="DIV_256" value="0x7" />
         <value caption="1:64 prescale value" name="DIV_64" value="0x6" />
         <value caption="1:32 prescale value" name="DIV_32" value="0x5" />
         <value caption="1:16 prescale value" name="DIV_16" value="0x4" />
         <value caption="1:8 prescale value" name="DIV_8" value="0x3" />
         <value caption="1:4 prescale value" name="DIV_4" value="0x2" />
         <value caption="1:2 prescale value" name="DIV_2" value="0x1" />
         <value caption="1:1 prescale value" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T7CON__TGATE">
         <value caption="Gated time accumulation is enabled" name="ENABLED" value="0x1" />
         <value caption="Gated time accumulation is disabled" name="DISABLED" value="0x0" />
      </value-group>
      <value-group caption="Synchronized Timer Start/Stop Enable bit" name="T7CON__SYNC">
         <value caption="Synchronized timer Start/Stop is enabled" name="ENABLED" value="0x1" />
         <value caption="Synchronized timer Start/Stop is disabled" name="DISABLED" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T7CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="STOP" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="CONTINUE" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T7CON__ON">
         <value caption="Module is enabled" name="ON" value="0x1" />
         <value caption="Module is disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Timer Clock Source Select bit" name="T8CON__TCS">
         <value caption="External clock from TxCK pin" name="EXT_CLK" value="0x1" />
         <value caption="Internal peripheral clock" name="INT_CLK" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T8CON__T32">
         <value caption="32-bit Timer mode" name="32_BIT" value="0x1" />
         <value caption="16-bit Timer mode" name="16_BIT" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T8CON__TCKPS">
         <value caption="1:256 prescale value" name="DIV_256" value="0x7" />
         <value caption="1:64 prescale value" name="DIV_64" value="0x6" />
         <value caption="1:32 prescale value" name="DIV_32" value="0x5" />
         <value caption="1:16 prescale value" name="DIV_16" value="0x4" />
         <value caption="1:8 prescale value" name="DIV_8" value="0x3" />
         <value caption="1:4 prescale value" name="DIV_4" value="0x2" />
         <value caption="1:2 prescale value" name="DIV_2" value="0x1" />
         <value caption="1:1 prescale value" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T8CON__TGATE">
         <value caption="Gated time accumulation is enabled" name="ENABLED" value="0x1" />
         <value caption="Gated time accumulation is disabled" name="DISABLED" value="0x0" />
      </value-group>
      <value-group caption="Synchronized Timer Start/Stop Enable bit" name="T8CON__SYNC">
         <value caption="Synchronized timer Start/Stop is enabled" name="ENABLED" value="0x1" />
         <value caption="Synchronized timer Start/Stop is disabled" name="DISABLED" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T8CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="STOP" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="CONTINUE" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T8CON__ON">
         <value caption="Module is enabled" name="ON" value="0x1" />
         <value caption="Module is disabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Timer Clock Source Select bit" name="T9CON__TCS">
         <value caption="External clock from TxCK pin" name="EXT_CLK" value="0x1" />
         <value caption="Internal peripheral clock" name="INT_CLK" value="0x0" />
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T9CON__T32">
         <value caption="32-bit Timer mode" name="32_BIT" value="0x1" />
         <value caption="16-bit Timer mode" name="16_BIT" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T9CON__TCKPS">
         <value caption="1:256 prescale value" name="DIV_256" value="0x7" />
         <value caption="1:64 prescale value" name="DIV_64" value="0x6" />
         <value caption="1:32 prescale value" name="DIV_32" value="0x5" />
         <value caption="1:16 prescale value" name="DIV_16" value="0x4" />
         <value caption="1:8 prescale value" name="DIV_8" value="0x3" />
         <value caption="1:4 prescale value" name="DIV_4" value="0x2" />
         <value caption="1:2 prescale value" name="DIV_2" value="0x1" />
         <value caption="1:1 prescale value" name="DIV_1" value="0x0" />
      </value-group>
