Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024MCF064.atdf
      <value-group caption="(Device mode) Packet Transfer Disable bit / (Host mode) Token Busy Indicator bit" name="U1CON__PKTDIS_TOKBUSY">
         <value caption="(Device mode)Token and packet processing disabled (set upon SETUP token received) / (Host mode)Token being executed by the USB module" name="" value="0x1" />
         <value caption="(Device mode)Token and packet processing enabled / (Host mode)No token being executed" name="" value="0x0" />
      </value-group>
      <value-group caption="Live Single-Ended Zero flag bit" name="U1CON__SE0">
         <value caption="Single Ended Zero detected on the USB" name="" value="0x1" />
         <value caption="No Single Ended Zero detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Live Differential Receiver JSTATE flag bit" name="U1CON__JSTATE">
         <value caption="JSTATE detected on the USB" name="" value="0x1" />
         <value caption="No JSTATE detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Low Speed Enable Indicator bit" name="U1ADDR__LSPDEN">
         <value caption="Next token command to be executed at Low Speed" name="" value="0x1" />
         <value caption="Next token command to be executed at Full Speed" name="" value="0x0" />
      </value-group>
      <value-group caption="Token Type Indicator bits" name="U1TOK__PID">
         <value caption="OUT (TX) token type transaction" name="" value="0x1" />
         <value caption="IN (RX) token type transaction" name="" value="0x9" />
         <value caption="SETUP (TX) token type transaction" name="" value="0xd" />
         <value caption="reserved" name="" value="0x0" />
         <value caption="reserved" name="" value="0x2" />
         <value caption="reserved" name="" value="0x3" />
         <value caption="reserved" name="" value="0x4" />
         <value caption="reserved" name="" value="0x5" />
         <value caption="reserved" name="" value="0x6" />
         <value caption="reserved" name="" value="0x7" />
         <value caption="reserved" name="" value="0x8" />
         <value caption="reserved" name="" value="0xa" />
         <value caption="reserved" name="" value="0xb" />
         <value caption="reserved" name="" value="0xc" />
         <value caption="reserved" name="" value="0xe" />
         <value caption="reserved" name="" value="0xf" />
      </value-group>
      <value-group caption="SOF Threshold Value bits" name="U1SOF__CNT">
         <value caption="64-byte packet" name="" value="0x4a" />
         <value caption="32-byte packet" name="" value="0x2a" />
         <value caption="16-byte packet" name="" value="0x1a" />
         <value caption="8-byte packet" name="" value="0x12" />
      </value-group>
      <value-group caption="Automatic Suspend Enable bit" name="U1CNFG1__UASUSPND">
         <value caption="USB module automatically suspends upon entry to Sleep mode. See the USUSPEND bit (UxPWRC) in" name="" value="0x1" />
         <value caption="USB module does not automatically suspend upon entry to Sleep mode. Software must use the USUSPEND bit (UxPWRC) to suspend the module" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Speed Device Enable bit" name="U1CNFG1__LSDEV">
         <value caption="USB module to operate in Low-Speed Device mode" name="" value="0x1" />
         <value caption="USB module to operate in OTG" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U1CNFG1__USBSIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="USB" name="U1CNFG1__UOEMON">
         <value caption="OE signal is active; it indicates intervals during which the D+/D- lines are driving" name="" value="0x1" />
         <value caption="OE signal is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="USB Eye-Pattern Test Enable bit" name="U1CNFG1__UTEYE">
         <value caption="Eye-Pattern Test is enabled" name="" value="0x1" />
         <value caption="Eye-Pattern Test is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP0__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP0__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP0__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP0__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP0__EPCONDIS">
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1" />
         <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Retry Disable bit" name="U1EP0__RETRYDIS">
         <value caption="Retry NAKed transactions is disabled" name="" value="0x1" />
         <value caption="Retry NAKed transactions is enabled; retry done in hardware" name="" value="0x0" />
      </value-group>
